k6/orders-test-resultados-iniciales.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: k6/orders-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m30s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 1m0s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 001/100 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 001/100 VUs  0m01.0s/1m00.0s

running (0m02.0s), 002/100 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 002/100 VUs  0m02.0s/1m00.0s

running (0m03.0s), 002/100 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 002/100 VUs  0m03.0s/1m00.0s

running (0m04.0s), 003/100 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 003/100 VUs  0m04.0s/1m00.0s

running (0m05.0s), 003/100 VUs, 0 complete and 0 interrupted iterations
default   [   8% ] 003/100 VUs  0m05.0s/1m00.0s

running (0m06.0s), 004/100 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 004/100 VUs  0m06.0s/1m00.0s

running (0m07.0s), 005/100 VUs, 0 complete and 0 interrupted iterations
default   [  12% ] 005/100 VUs  0m07.0s/1m00.0s

running (0m08.0s), 005/100 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 005/100 VUs  0m08.0s/1m00.0s

running (0m09.0s), 006/100 VUs, 0 complete and 0 interrupted iterations
default   [  15% ] 006/100 VUs  0m09.0s/1m00.0s

running (0m10.0s), 006/100 VUs, 0 complete and 0 interrupted iterations
default   [  17% ] 006/100 VUs  0m10.0s/1m00.0s

running (0m11.0s), 007/100 VUs, 0 complete and 0 interrupted iterations
default   [  18% ] 007/100 VUs  0m11.0s/1m00.0s

running (0m12.0s), 008/100 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 008/100 VUs  0m12.0s/1m00.0s

running (0m13.0s), 008/100 VUs, 0 complete and 0 interrupted iterations
default   [  22% ] 008/100 VUs  0m13.0s/1m00.0s

running (0m14.0s), 009/100 VUs, 0 complete and 0 interrupted iterations
default   [  23% ] 009/100 VUs  0m14.0s/1m00.0s

running (0m15.0s), 009/100 VUs, 0 complete and 0 interrupted iterations
default   [  25% ] 009/100 VUs  0m15.0s/1m00.0s

running (0m16.0s), 012/100 VUs, 0 complete and 0 interrupted iterations
default   [  27% ] 012/100 VUs  0m16.0s/1m00.0s

running (0m17.0s), 015/100 VUs, 0 complete and 0 interrupted iterations
default   [  28% ] 015/100 VUs  0m17.0s/1m00.0s

running (0m18.0s), 017/100 VUs, 0 complete and 0 interrupted iterations
default   [  30% ] 017/100 VUs  0m18.0s/1m00.0s

running (0m19.0s), 020/100 VUs, 0 complete and 0 interrupted iterations
default   [  32% ] 020/100 VUs  0m19.0s/1m00.0s

running (0m20.0s), 023/100 VUs, 0 complete and 0 interrupted iterations
default   [  33% ] 023/100 VUs  0m20.0s/1m00.0s

running (0m21.0s), 025/100 VUs, 0 complete and 0 interrupted iterations
default   [  35% ] 025/100 VUs  0m21.0s/1m00.0s

running (0m22.0s), 028/100 VUs, 0 complete and 0 interrupted iterations
default   [  37% ] 028/100 VUs  0m22.0s/1m00.0s

running (0m23.0s), 031/100 VUs, 0 complete and 0 interrupted iterations
default   [  38% ] 031/100 VUs  0m23.0s/1m00.0s

running (0m24.0s), 033/100 VUs, 0 complete and 0 interrupted iterations
default   [  40% ] 033/100 VUs  0m24.0s/1m00.0s

running (0m25.0s), 036/100 VUs, 0 complete and 0 interrupted iterations
default   [  42% ] 036/100 VUs  0m25.0s/1m00.0s

running (0m26.0s), 039/100 VUs, 0 complete and 0 interrupted iterations
default   [  43% ] 039/100 VUs  0m26.0s/1m00.0s

running (0m27.0s), 041/100 VUs, 0 complete and 0 interrupted iterations
default   [  45% ] 041/100 VUs  0m27.0s/1m00.0s

running (0m28.0s), 044/100 VUs, 0 complete and 0 interrupted iterations
default   [  47% ] 044/100 VUs  0m28.0s/1m00.0s

running (0m29.0s), 047/100 VUs, 0 complete and 0 interrupted iterations
default   [  48% ] 047/100 VUs  0m29.0s/1m00.0s

running (0m30.0s), 049/100 VUs, 0 complete and 0 interrupted iterations
default   [  50% ] 049/100 VUs  0m30.0s/1m00.0s

running (0m31.0s), 053/100 VUs, 1 complete and 0 interrupted iterations
default   [  52% ] 053/100 VUs  0m31.0s/1m00.0s

running (0m32.0s), 056/100 VUs, 2 complete and 0 interrupted iterations
default   [  53% ] 056/100 VUs  0m32.0s/1m00.0s

running (0m33.0s), 059/100 VUs, 2 complete and 0 interrupted iterations
default   [  55% ] 059/100 VUs  0m33.0s/1m00.0s

running (0m34.0s), 063/100 VUs, 3 complete and 0 interrupted iterations
default   [  57% ] 063/100 VUs  0m34.0s/1m00.0s

running (0m35.0s), 066/100 VUs, 3 complete and 0 interrupted iterations
default   [  58% ] 066/100 VUs  0m35.0s/1m00.0s

running (0m36.0s), 069/100 VUs, 4 complete and 0 interrupted iterations
default   [  60% ] 069/100 VUs  0m36.0s/1m00.0s

running (0m37.0s), 073/100 VUs, 5 complete and 0 interrupted iterations
default   [  62% ] 073/100 VUs  0m37.0s/1m00.0s

running (0m38.0s), 076/100 VUs, 5 complete and 0 interrupted iterations
default   [  63% ] 076/100 VUs  0m38.0s/1m00.0s

running (0m39.0s), 079/100 VUs, 6 complete and 0 interrupted iterations
default   [  65% ] 079/100 VUs  0m39.0s/1m00.0s

running (0m40.0s), 083/100 VUs, 6 complete and 0 interrupted iterations
default   [  67% ] 083/100 VUs  0m40.0s/1m00.0s

running (0m41.0s), 086/100 VUs, 7 complete and 0 interrupted iterations
default   [  68% ] 086/100 VUs  0m41.0s/1m00.0s

running (0m42.0s), 089/100 VUs, 8 complete and 0 interrupted iterations
default   [  70% ] 089/100 VUs  0m42.0s/1m00.0s

running (0m43.0s), 093/100 VUs, 8 complete and 0 interrupted iterations
default   [  72% ] 093/100 VUs  0m43.0s/1m00.0s

running (0m44.0s), 096/100 VUs, 9 complete and 0 interrupted iterations
default   [  73% ] 096/100 VUs  0m44.0s/1m00.0s

running (0m45.0s), 099/100 VUs, 9 complete and 0 interrupted iterations
default   [  75% ] 099/100 VUs  0m45.0s/1m00.0s

running (0m46.0s), 100/100 VUs, 12 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  0m46.0s/1m00.0s

running (0m47.0s), 100/100 VUs, 15 complete and 0 interrupted iterations
default   [  78% ] 100/100 VUs  0m47.0s/1m00.0s

running (0m48.0s), 100/100 VUs, 17 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  0m48.0s/1m00.0s

running (0m49.0s), 100/100 VUs, 20 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  0m49.0s/1m00.0s

running (0m50.0s), 100/100 VUs, 23 complete and 0 interrupted iterations
default   [  83% ] 100/100 VUs  0m50.0s/1m00.0s

running (0m51.0s), 100/100 VUs, 25 complete and 0 interrupted iterations
default   [  85% ] 100/100 VUs  0m51.0s/1m00.0s

running (0m52.0s), 100/100 VUs, 28 complete and 0 interrupted iterations
default   [  87% ] 100/100 VUs  0m52.0s/1m00.0s

running (0m53.0s), 100/100 VUs, 31 complete and 0 interrupted iterations
default   [  88% ] 100/100 VUs  0m53.0s/1m00.0s

running (0m54.0s), 100/100 VUs, 33 complete and 0 interrupted iterations
default   [  90% ] 100/100 VUs  0m54.0s/1m00.0s

running (0m55.0s), 099/100 VUs, 36 complete and 0 interrupted iterations
default   [  92% ] 099/100 VUs  0m55.0s/1m00.0s

running (0m56.0s), 096/100 VUs, 39 complete and 0 interrupted iterations
default   [  93% ] 096/100 VUs  0m56.0s/1m00.0s

running (0m57.0s), 094/100 VUs, 41 complete and 0 interrupted iterations
default   [  95% ] 094/100 VUs  0m57.0s/1m00.0s

running (0m58.0s), 091/100 VUs, 44 complete and 0 interrupted iterations
default   [  97% ] 091/100 VUs  0m58.0s/1m00.0s

running (0m59.0s), 088/100 VUs, 47 complete and 0 interrupted iterations
default   [  98% ] 088/100 VUs  0m59.0s/1m00.0s

running (1m00.0s), 086/100 VUs, 49 complete and 0 interrupted iterations
default   [ 100% ] 086/100 VUs  1m00.0s/1m00.0s

running (1m01.0s), 081/100 VUs, 54 complete and 0 interrupted iterations
default ↓ [ 100% ] 086/100 VUs  1m0s

running (1m02.0s), 077/100 VUs, 58 complete and 0 interrupted iterations
default ↓ [ 100% ] 086/100 VUs  1m0s

running (1m03.0s), 074/100 VUs, 61 complete and 0 interrupted iterations
default ↓ [ 100% ] 086/100 VUs  1m0s

running (1m04.0s), 069/100 VUs, 66 complete and 0 interrupted iterations
default ↓ [ 100% ] 086/100 VUs  1m0s

running (1m05.0s), 066/100 VUs, 69 complete and 0 interrupted iterations
default ↓ [ 100% ] 086/100 VUs  1m0s

running (1m06.0s), 062/100 VUs, 73 complete and 0 interrupted iterations
default ↓ [ 100% ] 086/100 VUs  1m0s

running (1m07.0s), 057/100 VUs, 78 complete and 0 interrupted iterations
default ↓ [ 100% ] 086/100 VUs  1m0s

running (1m08.0s), 054/100 VUs, 81 complete and 0 interrupted iterations
default ↓ [ 100% ] 086/100 VUs  1m0s

running (1m09.0s), 050/100 VUs, 85 complete and 0 interrupted iterations
default ↓ [ 100% ] 086/100 VUs  1m0s

running (1m10.0s), 046/100 VUs, 89 complete and 0 interrupted iterations
default ↓ [ 100% ] 086/100 VUs  1m0s

running (1m11.0s), 042/100 VUs, 93 complete and 0 interrupted iterations
default ↓ [ 100% ] 086/100 VUs  1m0s

running (1m12.0s), 038/100 VUs, 97 complete and 0 interrupted iterations
default ↓ [ 100% ] 086/100 VUs  1m0s

running (1m13.0s), 034/100 VUs, 101 complete and 0 interrupted iterations
default ↓ [ 100% ] 086/100 VUs  1m0s

running (1m14.0s), 030/100 VUs, 105 complete and 0 interrupted iterations
default ↓ [ 100% ] 086/100 VUs  1m0s

running (1m15.0s), 027/100 VUs, 108 complete and 0 interrupted iterations
default ↓ [ 100% ] 086/100 VUs  1m0s

running (1m16.0s), 023/100 VUs, 112 complete and 0 interrupted iterations
default ↓ [ 100% ] 086/100 VUs  1m0s

running (1m17.0s), 020/100 VUs, 115 complete and 0 interrupted iterations
default ↓ [ 100% ] 086/100 VUs  1m0s

running (1m18.0s), 018/100 VUs, 117 complete and 0 interrupted iterations
default ↓ [ 100% ] 086/100 VUs  1m0s

running (1m19.0s), 015/100 VUs, 120 complete and 0 interrupted iterations
default ↓ [ 100% ] 086/100 VUs  1m0s

running (1m20.0s), 012/100 VUs, 123 complete and 0 interrupted iterations
default ↓ [ 100% ] 086/100 VUs  1m0s

running (1m21.0s), 010/100 VUs, 125 complete and 0 interrupted iterations
default ↓ [ 100% ] 086/100 VUs  1m0s

running (1m22.0s), 007/100 VUs, 128 complete and 0 interrupted iterations
default ↓ [ 100% ] 086/100 VUs  1m0s

running (1m23.0s), 004/100 VUs, 131 complete and 0 interrupted iterations
default ↓ [ 100% ] 086/100 VUs  1m0s

running (1m24.0s), 002/100 VUs, 133 complete and 0 interrupted iterations
default ↓ [ 100% ] 086/100 VUs  1m0s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration......................: avg=30s    min=30s    med=30s    max=30s    p(90)=30s    p(95)=30s   
    http_req_failed........................: 100.00% 135 out of 135
    http_reqs..............................: 135     1.599466/s

    EXECUTION
    iteration_duration.....................: avg=30.01s min=30.01s med=30.01s max=30.02s p(90)=30.01s p(95)=30.01s
    iterations.............................: 135     1.599466/s
    vus....................................: 2       min=1          max=100
    vus_max................................: 100     min=100        max=100

    NETWORK
    data_received..........................: 0 B     0 B/s
    data_sent..............................: 11 kB   133 B/s



running (1m24.4s), 000/100 VUs, 135 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  1m0s